org/for-completeness.org
#+options: toc:nil
#+begin_export html
---
title: "For completeness: real numbers and Cartesian geometry"
date: 2024-04-20T10:40:00-04:00
math: true
summary: >
  In mathematics, if you squint,
  the word “real” has a kind of eldritch quality.
  Although calculus students work confidently with them,
  and they enable all kinds of nice behavior in topology,
  the definition of a real number is, well, surreal.
  The title of this blog post is a pun.
  You might ask why we need the real numbers,
  and one answer is “for completeness”.
  For the same reason, I thought a blog post would be useful.
---
#+end_export

In mathematics, if you squint,
the word “real” has a kind of eldritch quality.
Although calculus students work confidently with them,
and they enable all kinds of nice behavior in topology,
the definition of a /real number/ is, well, surreal.
The title of this blog post is a pun.
You might ask why we need the real numbers,
and one answer is “for completeness”.
For the same reason, I thought a blog post would be useful.

#+toc: headlines 2
* Constructing numbers
I learned a little of how to prove things
and the culture of mathematics
by taking a class taught out of Apostol’s /Calculus./
As a first-year in college,
I remember being thoroughly at sea in that class,
whose professor apologetically
translated the symbols “$\forall$” and “$\exists$” into English
a couple of days into the class—they had appeared on the board
within the first week.

One of the aspects of that class that I appreciated
was the /construction/ of the real numbers.
I’d like to take us on a whirlwind tour through that construction.

We seek a mathematical object $\mathbb{R}$
called the “real numbers” with the following
reasonable properties of numbers.

- Counting numbers $1,2,\ldots$ are real numbers.
- Real numbers may be added to produce other real numbers.
  Addition is associative and commutative.
- Real numbers may also be /subtracted./ Subtraction “undoes” addition.
  There is a /unique/ number $0$
  which is equal to $x - x$ for every real number $x$.
  This number $0$ is an /identity/ for addition.
- Real numbers may be multiplied.
  Multiplication is associative and commutative
  and /distributes/ over addition.
  It follows that $x * 0 = 0$ for every real number $x$.
- Multiplication can be “undone” by division in the sense that
  $x \div y$ is the unique number $z$ such that $z * y = x$—except
  that because $x * 0 = 0$ for every real number $x$,
  there is no sensible way to define division by $0$, /so we don’t./
- Real numbers are /ordered/ in a way that /extends/ the usual ordering
  of the counting numbers and is compatible with addition and multiplication
  in the way that you expect.
- A set $S$ of real numbers has an /upper bound/
  when there is a real number $B$ such that every $x$ in $S$
  satisfies $x \le B$.
  A /least upper bound/ (or /supremum/) for $S$
  is an upper bound $\sup S$ such that every upper bound $B$
  satisfies $\sup S \le B$.
  Put another way, if $y < \sup S$,
  then $y$ is not an upper bound for $S$,
  so there must be some actual element $x$ of $s$ satisfying $y < x$.
  Every set of real numbers that has an upper bound
  has a least upper bound.

While “reasonable”, as I’ll attempt to argue in a second,
this last property is a good deal more complex than the previous ones.
Indeed, this behavior of real numbers is what makes them eldritch
(and different from the /rational/ numbers).

Here’s why this property is reasonable:
suppose you have a way of /approximating/ a quantity by real numbers.
Like for example,
suppose you have a method of computing more and more digits of this number
in a decimal expansion.
I claim that a reasonable definition of numbers
should have an actual number that is what is being approximated.
That is, given that we are able to compute (theoretically)
$\pi$ to an arbitrary number of decimal places,
$\pi$ is a real number.
Notice that decimal expansions of $\pi$ have an upper bound
($4$ will do, for instance),
and that each decimal expansion is larger than the last.
Thus, since the set of decimal expansions of $\pi$ has a least upper bound,
we can /define/ that least upper bound to “be” $\pi$.
It turns out to have all the properties of $\pi$
that we can compute analytically,
so this “synthetic” definition makes sense.

So let’s go through our whirlwind tour.

* The counting numbers
We’re going to suppose that we already understand the counting numbers:
they have the defining property that you start somewhere
and always know what the next one is.
That is, after $1$ comes $2$, after $2$ you have $3$ and so on.

In other simulated confusions, ahem, /constructions/
of various fields of mathematics,
one starts with the idea of a “set”
and ways of forming new sets from old ones
and from there /defines/ the counting numbers and their /successor function/
by some scheme.
Let’s not do things this way:
it makes possible certain silly statements,
like, “what are the elements of $6$”
which don’t seem reasonable to me.

There are people who are skeptical
about the idea of infinity in mathematics.
I don’t want to poo-poo or misrepresent these people’s intellectual
commitments, which can be really interesting to read defended.
I’ll just confine myself to noticing that there’s a real
psychological difference between the claim
“I will never run out of counting numbers,
since after any counting number I know which one comes next,
and my scheme for counting never reuses numbers”
and “I can conceive of the collection of counting numbers
together in its total infinity”.

