content/posts/for-completeness.html
---
title: "For completeness: real numbers and Cartesian geometry"
date: 2024-04-20T10:40:00-04:00
math: true
summary: >
  In mathematics, if you squint,
  the word “real” has a kind of eldritch quality.
  Although calculus students work confidently with them,
  and they enable all kinds of nice behavior in topology,
  the definition of a real number is, well, surreal.
  The title of this blog post is a pun.
  You might ask why we need the real numbers,
  and one answer is “for completeness”.
  For the same reason, I thought a blog post would be useful.
---

<p>
In mathematics, if you squint,
the word “real” has a kind of eldritch quality.
Although calculus students work confidently with them,
and they enable all kinds of nice behavior in topology,
the definition of a <i>real number</i> is, well, surreal.
The title of this blog post is a pun.
You might ask why we need the real numbers,
and one answer is “for completeness”.
For the same reason, I thought a blog post would be useful.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7040672">1. Constructing numbers</a></li>
<li><a href="#org7868838">2. The counting numbers</a></li>
<li><a href="#orgca1b02c">3. The integers</a></li>
<li><a href="#orgf7adde5">4. The rational numbers</a></li>
<li><a href="#org7e0e06d">5. Ordering</a></li>
<li><a href="#org0cf6992">6. Upper bounds</a></li>
<li><a href="#orgad9993c">7. Completeness</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7040672" class="outline-2">
<h2 id="org7040672"><span class="section-number-2">1.</span> Constructing numbers</h2>
<div class="outline-text-2" id="text-1">
<p>
I learned a little of how to prove things
and the culture of mathematics
by taking a class taught out of Apostol’s <i>Calculus.</i>
As a first-year in college,
I remember being thoroughly at sea in that class,
whose professor apologetically
translated the symbols “\(\forall\)” and “\(\exists\)” into English
a couple of days into the class—they had appeared on the board
within the first week.
</p>

<p>
One of the aspects of that class that I appreciated
was the <i>construction</i> of the real numbers.
I’d like to take us on a whirlwind tour through that construction.
</p>

<p>
We seek a mathematical object \(\mathbb{R}\)
called the “real numbers” with the following
reasonable properties of numbers.
</p>

<ul class="org-ul">
<li>Counting numbers \(1,2,\ldots\) are real numbers.</li>
<li>Real numbers may be added to produce other real numbers.
Addition is associative and commutative.</li>
<li>Real numbers may also be <i>subtracted.</i> Subtraction “undoes” addition.
There is a <i>unique</i> number \(0\)
which is equal to \(x - x\) for every real number \(x\).
This number \(0\) is an <i>identity</i> for addition.</li>
<li>Real numbers may be multiplied.
Multiplication is associative and commutative
and <i>distributes</i> over addition.
It follows that \(x * 0 = 0\) for every real number \(x\).</li>
<li>Multiplication can be “undone” by division in the sense that
\(x \div y\) is the unique number \(z\) such that \(z * y = x\)—except
that because \(x * 0 = 0\) for every real number \(x\),
there is no sensible way to define division by \(0\), <i>so we don’t.</i></li>
<li>Real numbers are <i>ordered</i> in a way that <i>extends</i> the usual ordering
of the counting numbers and is compatible with addition and multiplication
in the way that you expect.</li>
<li>A set \(S\) of real numbers has an <i>upper bound</i>
when there is a real number \(B\) such that every \(x\) in \(S\)
satisfies \(x \le B\).
A <i>least upper bound</i> (or <i>supremum</i>) for \(S\)
is an upper bound \(\sup S\) such that every upper bound \(B\)
satisfies \(\sup S \le B\).
Put another way, if \(y < \sup S\),
then \(y\) is not an upper bound for \(S\),
so there must be some actual element \(x\) of \(s\) satisfying \(y < x\).
Every set of real numbers that has an upper bound
has a least upper bound.</li>
</ul>

<p>
While “reasonable”, as I’ll attempt to argue in a second,
this last property is a good deal more complex than the previous ones.
Indeed, this behavior of real numbers is what makes them eldritch
(and different from the <i>rational</i> numbers).
</p>

<p>
Here’s why this property is reasonable:
suppose you have a way of <i>approximating</i> a quantity by real numbers.
Like for example,
suppose you have a method of computing more and more digits of this number
in a decimal expansion.
I claim that a reasonable definition of numbers
should have an actual number that is what is being approximated.
That is, given that we are able to compute (theoretically)
\(\pi\) to an arbitrary number of decimal places,
\(\pi\) is a real number.
Notice that decimal expansions of \(\pi\) have an upper bound
(\(4\) will do, for instance),
and that each decimal expansion is larger than the last.
Thus, since the set of decimal expansions of \(\pi\) has a least upper bound,
we can <i>define</i> that least upper bound to “be” \(\pi\).
It turns out to have all the properties of \(\pi\)
that we can compute analytically,
so this “synthetic” definition makes sense.
</p>

<p>
So let’s go through our whirlwind tour.
</p>
</div>
</div>

<div id="outline-container-org7868838" class="outline-2">
<h2 id="org7868838"><span class="section-number-2">2.</span> The counting numbers</h2>
<div class="outline-text-2" id="text-2">
<p>
We’re going to suppose that we already understand the counting numbers:
they have the defining property that you start somewhere
and always know what the next one is.
That is, after \(1\) comes \(2\), after \(2\) you have \(3\) and so on.
</p>

<p>
In other simulated confusions, ahem, <i>constructions</i>
of various fields of mathematics,
one starts with the idea of a “set”
and ways of forming new sets from old ones
and from there <i>defines</i> the counting numbers and their <i>successor function</i>
by some scheme.
Let’s not do things this way:
it makes possible certain silly statements,
like, “what are the elements of \(6\)”
which don’t seem reasonable to me.
</p>

<p>
There are people who are skeptical
about the idea of infinity in mathematics.
I don’t want to poo-poo or misrepresent these people’s intellectual
commitments, which can be really interesting to read defended.
I’ll just confine myself to noticing that there’s a real
psychological difference between the claim
“I will never run out of counting numbers,
since after any counting number I know which one comes next,
and my scheme for counting never reuses numbers”
and “I can conceive of the collection of counting numbers
together in its total infinity”.
</p>
</div>
</div>
