org/for-completeness.org
* The integers
Addition of counting numbers is another something we understand.
We know how to compute $2 + 3$ and that it is $3 + 2$.
I feel compelled to note the long history of the statement $2 + 2 = 5$,
which dates back to at least Orwell’s 1984 but is older,
and had a recent featured appearance in the “culture wars”,
which caused well-intentioned progressive mathematicians
a certain amount of angst and bending-over-backwards
to affirm that $2 + 2 = 5$ can be a sensical mathematical statement;
precisely the kind of thing that Orwell famously decried.
Part of what makes this construction exercise sort of exhilerating
and deeply silly is that what we are doing is /agreeing/ amongst ourselves
that we know what the symbols $2$, $+$, $5$ and $=$ mean.
In so doing, it must be noted that this agreement
and the meanings agreed upon
have a certain arbitrariness to them.
Changing our agreements about meaning
should have nothing to do with doublethink, newspeak, etc.
but are instead an opportunity to invite creativity,
a necessary part of the practice of mathematics,
back into what can be an intensely conservative field.

Anyway, our goal here is to follow our common sense here,
a goal that has dubious outcomes in many situations,
and indeed the goal of this blog post is to point up the dubiousness
of the real numbers.

Subtraction is also something we understand,
but it leads us to our first hint of the eldritch:
negative numbers.
Since $2 - 3$ is a sensible formulation:
we would like to be able to subtract numbers willy-nilly,
it forces us to define numbers which we did not have previously.

It’s fun to play with $0$ in particular:
the rules of algebra tell us that since $x + y = x + y$,
we have $x - x = y - y$ for every pair of real numbers.
Similarly, $0$ is the only number for which
$x + 0 = x$.
If there were another such number, say $0'$,
adding it to $0$ allows us to deduce
that $0 + 0' = 0$ on the one hand, but also $0'$ on the other,
so these are the same number by the transitive nature of equality.

* The rational numbers
Integers may be freely multiplied,
and we argued above that division, whatever it is,
should make sense only for nonzero numbers.
It’s fun to see that our definitions
force the existence of at most one number $1$
for which $x * 1 = x$ for all real numbers $x$,
that $x * 0 = 0$ for all real numbers $x$
and so $1 \ne 0$.

But how to /define/ numbers that allow division?
We have already from school the idea of fractions $\frac{a}{b}$.
This generalizes in a fun way:
a /ring/ in mathematics, is a place where you can play the two games
of /addition/ and /multiplication./
Addition, like in school, is associative and commutative,
and has an identity element $0$ and negatives,
but mathematicians are happy to merely require
multiplication to be associative and distribute over addition.
Usually we require the existence of a $1$ in our rings,
but there are times that mathematicians forego even that.

Anyway, if you have a set $S$ in a ring $R$ (with $1$)
which is /multiplicatively closed/
in the sense that $s * t$ is in $S$ when $s$ and $t$ are and contains $1$,
you can form a /ring of fractions/ $S^{-1}R$
whose elements are formal fractions with denominators in $S$.
When $R$ is commutative (that is, /multiplication/ in $R$ is commutative)
and $S$ does not contain $0$ nor any element $s$
for which there exists a nonzero element $t$ such that $st = 0$,
the ring of fractions behaves essentially like you would expect:
$\frac{a}{b} + \frac{c}{d} = \frac{ad + bc}{bd}$,
$\frac{a}{b} * \frac{c}{d} = \frac{ac}{bd}$, and so on.
The cool thing I wanted to mention
is that this construction actually makes sense more generally!

In our situation, the set $S$ is just all of the integers which are nonzero,
which implies that the ring of fractions is actually a
/field,/ in the sense that we have a commutative ring in which
every nonzero element of the field
has a multiplicative inverse.

* Ordering
There’s a little to say here, but not too much.
One wants an ordering on the real numbers that extends the usual one
on the counting numbers
and is compatible with addition
in the sense that if $a < b$ implies that $a + c < b + c$.
This actually implies that /negation reverses order/
since $a < b$ implies that $a + -(a + b) < b + -(a + b)$,
and these numbers are equal to $-b$ on the left and $-a$ on the right.
Since for every pair of counting numbers $a$ and $b$,
we have the trichotomy: either $a = b$, $a < b$ or $a > b$,
it seems reasonable that this should be true for real numbers as well.
It /cannot/ be true that $a < b$ implies that $a * c < b * c$
for all numbers, because of the existence of negation and zero,
but we /can/ say that we would like this to be true for all
real numbers $c$ which are positive (that is, for which $c > 0$).

Actually, although the ordering stuff is pretty straightforward,
(in particular, we didn’t have to invent new numbers)
it’s worth pointing out that having such a /total order/
is one of the properties which /characterize/ the real numbers.

* Upper bounds
This is where things really get eldritch.
First of all, the rational numbers, $\mathbb{Q}$, do not have
least upper bounds.
Firstly, note that $\sqrt{2}$ is not a rational number.
If you’ve never proved this, it’s so cute:
suppose you could write $\sqrt{2}$ as $\frac{p}{q}$ for integers $p$ and $q$
which are in “lowest terms”.
Then you have to ask whether $p$ and $q$ are even or odd.
It turns out neither answer will do, so it cannot be possible to write
$\sqrt{2}$ as $\frac{p}{q}$.
But, we can clearly ask, of any rational number $r = \frac{p}{q}$,
whether $r^2$ is greater than or less than $2$.
The collection of all rational numbers for which the answer is “less than”
has an upper bound but no least upper bound.
This is a fun exercise:
suppose you have a rational number $r$ whose square is greater than $2$.
Can you find a general way of constructing a rational number $r'$
which also satisfies $r'^2 > 2$
but which is smaller than $r$?

So to satisfy the least upper bound condition,
we are going to have to add real numbers.
A /lot/ of them, actually.
Formally, define a /cut/ $r$ in $\mathbb{Q}$ to be a partition of $\mathbb{Q}$
into two nonempty pieces, $r^-$ and $r^+$,
which do not overlap (this is what I mean by a partition)
and are closed under ordering,
in the sense that if $s$ is an element of $r^-$
and $t < s$, then $t \in r^-$,
and similarly if $s \in r^+$ and $t > s$, then $t \in r^+$.

Now, if $S$ is a subset of $\mathbb{Q}$ which is bounded above,
then $S$ /generates/ a cut $r$
by the rule that an element of $\mathbb{Q}$ is in $r^-$
if it is less than or equal to some element of $S$.
Because $S$ is bounded above,
the complement of this set $r^+$ is nonempty.
So if we can turn the collection of /Dedekind cuts/
into a field, we’ll win.

Defining the rules of algebra on these cuts
is not so bad, but not fun enough to want to do here.
I’ll confine myself to saying that $(r + r')^-$
should just be the set of elements of $\mathbb{Q}$
of the form $q + q'$, where $q \in r^-$ and $q' \in r'^-$.

This is a strange definition!
It’s super weird!
It works great!

