org/for-completeness.org
* Completeness
The definitions above have a couple interesting and useful consequences.
The first one I want to mention is that the real numbers are /Archimedean/
in the sense that every real number $r$
has a counting number $n$ larger than it.
Indeed, if $r$ is negative this is clear,
and if $r$ is positive,
the collection of counting numbers less than $r$
is bounded above (by $r$),
has a least upper bound (which is actually a counting number, it turns out),
and we can take $n$ to be that supremum plus one.

Here is the other.
A /sequence/ $x_1,x_2,\ldots$ of real numbers
/converges/ to a real number $x$
when for every $\epsilon > 0$
(which you are supposed to suppose is given to you by an adversary)
you can find a large number $N > 0$
such that for all $n > N$,
the statement $|x_n - x| < \epsilon$ is true.
In English, the elements of the sequence are getting closer and closer to $x$,
even if it may be the case that none of them is precisely equal to $x$.

/A priori/ weaker than the notion of convergence
is the notion of being /Cauchy./
(Augustin-Louis Cauchy, possibly mathematics’ most useful pedant,
went around poking holes in the thinking of his contemporaries and
predecessors, or so I’m told. As a result of his efforts,
mathematics is more rigorous, which given its unreasonable
applications to reality, is probably for the best.
I have a stuffed animal given to me by a high school boyfriend;
in college I named him Cauchy.)

A Cauchy sequence is one for which for any $\epsilon > 0$,
there exists $N$ big enough so that whenever $n$ and $m$ are chosen
greater than $N$,
we have $|x_n - x_m| < \epsilon$.
In English, the elements of the sequence get closer and closer
to /each other/ as the sequence goes along.

> *Theorem.* Every Cauchy sequence of real numbers converges.

More generally, in a /metric space/
(more about which soon),
the notions of convergence and being Cauchy make sense
by using the notion of distance.
A metric space is /complete/
if the above theorem holds.
Thus $\mathbb{R}$ is complete as a metric space,
while its subset $\mathbb{Q}$ is not.
