content/posts/for-completeness.html

<div id="outline-container-orgad9993c" class="outline-2">
<h2 id="orgad9993c"><span class="section-number-2">7.</span> Completeness</h2>
<div class="outline-text-2" id="text-7">
<p>
The definitions above have a couple interesting and useful consequences.
The first one I want to mention is that the real numbers are <i>Archimedean</i>
in the sense that every real number \(r\)
has a counting number \(n\) larger than it.
Indeed, if \(r\) is negative this is clear,
and if \(r\) is positive,
the collection of counting numbers less than \(r\)
is bounded above (by \(r\)),
has a least upper bound (which is actually a counting number, it turns out),
and we can take \(n\) to be that supremum plus one.
</p>

<p>
Here is the other.
A <i>sequence</i> \(x_1,x_2,\ldots\) of real numbers
<i>converges</i> to a real number \(x\)
when for every \(\epsilon > 0\)
(which you are supposed to suppose is given to you by an adversary)
you can find a large number \(N > 0\)
such that for all \(n > N\),
the statement \(|x_n - x| < \epsilon\) is true.
In English, the elements of the sequence are getting closer and closer to \(x\),
even if it may be the case that none of them is precisely equal to \(x\).
</p>

<p>
<i>A priori</i> weaker than the notion of convergence
is the notion of being <i>Cauchy.</i>
(Augustin-Louis Cauchy, possibly mathematics’ most useful pedant,
went around poking holes in the thinking of his contemporaries and
predecessors, or so I’m told. As a result of his efforts,
mathematics is more rigorous, which given its unreasonable
applications to reality, is probably for the best.
I have a stuffed animal given to me by a high school boyfriend;
in college I named him Cauchy.)
</p>

<p>
A Cauchy sequence is one for which for any \(\epsilon > 0\),
there exists \(N\) big enough so that whenever \(n\) and \(m\) are chosen
greater than \(N\),
we have \(|x_n - x_m| < \epsilon\).
In English, the elements of the sequence get closer and closer
to <i>each other</i> as the sequence goes along.
</p>

<p>
&gt; <b>Theorem.</b> Every Cauchy sequence of real numbers converges.
</p>

<p>
More generally, in a <i>metric space</i>
(more about which soon),
the notions of convergence and being Cauchy make sense
by using the notion of distance.
A metric space is <i>complete</i>
if the above theorem holds.
Thus \(\mathbb{R}\) is complete as a metric space,
while its subset \(\mathbb{Q}\) is not.
</p>
</div>
</div>
